Repository: xxmnewman9xx/studyplanner
Catalog: plugins/studyplanner-app-intents/ios/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, hi, ja, ko, pt_br, zh_hans

source: Add Assignment
ar: إضافة واجب
de: Aufgabe hinzufügen
es: Añadir tarea
fr: Ajouter un devoir
hi: असाइनमेंट जोड़ें
ja: 課題を追加
ko: 과제 추가
pt_br: Adicionar tarefa
zh_hans: 添加作业

source: Assignment
ar: الواجب
de: Aufgabe
es: Tarea
fr: Devoir
hi: असाइनमेंट
ja: 課題
ko: 과제
pt_br: Tarefa
zh_hans: 作业

source: Class
ar: مادة
de: Kurs
es: Materia
fr: Cours
hi: कक्षा
ja: 授業
ko: 수업
pt_br: Disciplina
zh_hans: 课程

source: Deadline
ar: موعد نهائي
de: Frist
es: Entrega
fr: Échéance
hi: डेडलाइन
ja: 締め切り
ko: 마감
pt_br: Prazo
zh_hans: 截止任务

source: Hear the next study step from today's plan.
ar: استمع إلى خطوة المذاكرة التالية من خطة اليوم.
de: Hör dir den nächsten Lernschritt aus deinem heutigen Plan an.
es: Escucha el siguiente paso de estudio del plan de hoy.
fr: Écoute la prochaine étape de révision du plan du jour.
hi: आज की योजना से पढ़ाई का अगला कदम सुनें।
ja: 今日のプランから次の学習ステップを確認します。
ko: 오늘 계획에서 다음 공부 단계를 알려 드려요.
pt_br: Ouça o próximo passo de estudo do plano de hoje.
zh_hans: 听取今天计划中的下一步学习安排。

source: Hear your next three deadlines.
ar: استمع إلى مواعيدك النهائية الثلاثة التالية.
de: Hör dir deine nächsten drei Fristen an.
es: Escucha tus próximas tres entregas.
fr: Écoute tes trois prochaines échéances.
hi: अपनी अगली तीन डेडलाइन सुनें।
ja: 次の3件の締め切りを確認します。
ko: 다음 마감 3개를 알려 드려요.
pt_br: Ouça seus próximos três prazos.
zh_hans: 听取接下来的三个截止日期。

source: Open Class
ar: فتح المادة
de: Kurs öffnen
es: Abrir materia
fr: Ouvrir le cours
hi: कक्षा खोलें
ja: 授業を開く
ko: 수업 열기
pt_br: Abrir disciplina
zh_hans: 打开课程

source: Open Deadline
ar: فتح الموعد النهائي
de: Frist öffnen
es: Abrir entrega
fr: Ouvrir l’échéance
hi: डेडलाइन खोलें
ja: 締め切りを開く
ko: 마감 열기
pt_br: Abrir prazo
zh_hans: 打开截止任务

source: Open Scanner
ar: فتح الماسح
de: Scanner öffnen
es: Abrir escáner
fr: Ouvrir le scanner
hi: स्कैनर खोलें
ja: スキャナを開く
ko: 스캐너 열기
pt_br: Abrir scanner
zh_hans: 打开扫描

source: Open StudyPlanner's syllabus scanner.
ar: يفتح ماسح المناهج في StudyPlanner.
de: Öffnet den Kursplan-Scanner von StudyPlanner.
es: Abre el escáner de temarios de StudyPlanner.
fr: Ouvre le scanner de plans de cours de StudyPlanner.
hi: StudyPlanner का सिलेबस स्कैनर खोलें।
ja: StudyPlannerのシラバススキャナを開きます。
ko: StudyPlanner의 강의계획서 스캐너를 열어요.
pt_br: Abre o scanner de ementas do StudyPlanner.
zh_hans: 打开 StudyPlanner 的课程大纲扫描。

source: Save an assignment for StudyPlanner to review when you open the app.
ar: احفظ واجبًا لمراجعته عند فتح StudyPlanner.
de: Speichere eine Aufgabe, die du beim Öffnen von StudyPlanner prüfst.
es: Guarda una tarea para revisarla cuando abras StudyPlanner.
fr: Enregistre un devoir à vérifier à l’ouverture de StudyPlanner.
hi: एक असाइनमेंट सहेजें, जिसे StudyPlanner खोलने पर आप जाँचेंगे।
ja: 課題を保存し、StudyPlannerを開いたときに確認します。
ko: 과제를 저장해 두고 StudyPlanner를 열 때 확인해요.
pt_br: Salve uma tarefa para revisar quando abrir o StudyPlanner.
zh_hans: 保存一项作业，打开 StudyPlanner 时再确认。

source: Scan Syllabus
ar: مسح المنهج
de: Kursplan scannen
es: Escanear temario
fr: Scanner un plan de cours
hi: सिलेबस स्कैन करें
ja: シラバスをスキャン
ko: 강의계획서 스캔
pt_br: Escanear ementa
zh_hans: 扫描课程大纲

source: Study Now
ar: ذاكر الآن
de: Jetzt lernen
es: Estudiar ahora
fr: Réviser maintenant
hi: अभी पढ़ें
ja: 今すぐ勉強
ko: 지금 공부
pt_br: Estudar agora
zh_hans: 现在学习

source: What Should I Study Now?
ar: ماذا أذاكر الآن؟
de: Was soll ich jetzt lernen?
es: ¿Qué debo estudiar ahora?
fr: Que dois-je réviser maintenant ?
hi: अब मुझे क्या पढ़ना चाहिए?
ja: 今何を勉強すればいい？
ko: 지금 뭘 공부해야 할까요?
pt_br: O que devo estudar agora?
zh_hans: 我现在该学什么？

source: What's Due
ar: المستحقات
de: Was ist fällig
es: Pendientes
fr: À rendre
hi: क्या बाकी है
ja: 締め切り
ko: 마감 일정
pt_br: Prazos
zh_hans: 截止任务

source: What's Due?
ar: ما المطلوب تسليمه؟
de: Was ist fällig?
es: ¿Qué tengo pendiente?
fr: Qu’est-ce que j’ai à rendre ?
hi: क्या जमा करना है?
ja: 締め切りは？
ko: 마감이 뭐가 있나요?
pt_br: O que vence?
zh_hans: 有哪些截止任务？

source: What's the assignment? Include the class and due date.
ar: ما الواجب؟ اذكر المادة وموعد التسليم.
de: Welche Aufgabe? Nenne auch Kurs und Abgabedatum.
es: ¿Cuál es la tarea? Incluye la materia y la fecha de entrega.
fr: Quel est le devoir ? Précise le cours et la date de remise.
hi: कौन सा असाइनमेंट है? विषय और जमा करने की तारीख भी बताएँ।
ja: どんな課題ですか？授業名と締め切り日も教えてください。
ko: 어떤 과제인가요? 수업과 마감일도 말해 주세요.
pt_br: Qual é a tarefa? Inclua a disciplina e a data de entrega.
zh_hans: 是什么作业？请说出课程和截止日期。

# intent.due.inDays
source: due in %lld days
ar: مستحق خلال %lld يوم
de: fällig in %lld Tagen
es: vence en %lld días
fr: dans %lld jours
hi: %lld दिनों में जमा करना है
ja: %lld日後が締め切り
ko: %lld일 후 마감
pt_br: vence em %lld dias
zh_hans: %lld天后截止

# intent.due.none
source: Nothing is due soon.
ar: لا توجد مواعيد تسليم قريبة.
de: Demnächst ist nichts fällig.
es: No tienes entregas próximas.
fr: Rien à rendre prochainement.
hi: जल्द कुछ भी जमा नहीं करना है।
ja: 近い締め切りはありません。
ko: 곧 마감되는 항목이 없어요.
pt_br: Nada vence em breve.
zh_hans: 近期没有截止的任务。

# intent.due.overdue
source: overdue
ar: متأخر
de: überfällig
es: ya venció
fr: en retard
hi: समय निकल चुका है
ja: 締め切りを過ぎています
ko: 마감 지남
pt_br: já venceu
zh_hans: 已逾期

# intent.due.summary
source: Next up: %@.
ar: التالي: %@.
de: Als Nächstes: %@.
es: Lo próximo: %@.
fr: À venir : %@.
hi: आगे: %@।
ja: 次の予定：%@。
ko: 다음 일정: %@.
pt_br: A seguir: %@.
zh_hans: 接下来：%@。

# intent.due.today
source: due today
ar: مستحق اليوم
de: heute fällig
es: vence hoy
fr: pour aujourd’hui
hi: आज जमा करना है
ja: 今日が締め切り
ko: 오늘 마감
pt_br: vence hoje
zh_hans: 今天截止

# intent.due.tomorrow
source: due tomorrow
ar: مستحق غدًا
de: morgen fällig
es: vence mañana
fr: pour demain
hi: कल जमा करना है
ja: 明日が締め切り
ko: 내일 마감
pt_br: vence amanhã
zh_hans: 明天截止

# intent.inbox.failed
source: Couldn't save that. Open StudyPlanner and add it there.
ar: تعذّر الحفظ. افتح StudyPlanner وأضفه من هناك.
de: Das konnte nicht gespeichert werden. Öffne StudyPlanner und füge es dort hinzu.
es: No se pudo guardar. Abre StudyPlanner y agrégalo allí.
fr: Impossible d’enregistrer. Ouvre StudyPlanner et ajoute-le là-bas.
hi: इसे सहेजा नहीं जा सका। StudyPlanner खोलकर वहीं जोड़ें।
ja: 保存できませんでした。StudyPlannerを開いて追加してください。
ko: 저장하지 못했어요. StudyPlanner를 열어 직접 추가하세요.
pt_br: Não foi possível salvar. Abra o StudyPlanner e adicione por lá.
zh_hans: 无法保存。请打开 StudyPlanner 在应用内添加。

# intent.inbox.saved
source: Saved. Open StudyPlanner to confirm.
ar: تم الحفظ. افتح StudyPlanner للتأكيد.
de: Gespeichert. Öffne StudyPlanner zum Bestätigen.
es: Guardado. Abre StudyPlanner para confirmarlo.
fr: Enregistré. Ouvre StudyPlanner pour confirmer.
hi: सहेज लिया गया। पुष्टि करने के लिए StudyPlanner खोलें।
ja: 保存しました。StudyPlannerを開いて確定してください。
ko: 저장했어요. StudyPlanner를 열어 확인하세요.
pt_br: Salvo. Abra o StudyPlanner para confirmar.
zh_hans: 已保存。打开 StudyPlanner 进行确认。

# intent.refresh
source: Open StudyPlanner to refresh today's plan.
ar: افتح StudyPlanner لتحديث خطة اليوم.
de: Öffne StudyPlanner, um den heutigen Plan zu aktualisieren.
es: Abre StudyPlanner para actualizar el plan de hoy.
fr: Ouvre StudyPlanner pour actualiser le plan du jour.
hi: आज की योजना ताज़ा करने के लिए StudyPlanner खोलें।
ja: 今日のプランを更新するには、StudyPlannerを開いてください。
ko: 오늘 계획을 새로 고치려면 StudyPlanner를 여세요.
pt_br: Abra o StudyPlanner para atualizar o plano de hoje.
zh_hans: 打开 StudyPlanner 以刷新今天的计划。

# intent.studyNow.clear
source: Nothing needs studying right now. You're all caught up.
ar: لا شيء يحتاج إلى مذاكرة الآن. أنت مواكب لكل شيء.
de: Gerade steht nichts zum Lernen an. Du bist auf dem neuesten Stand.
es: Ahora mismo no tienes nada que estudiar. Vas al día.
fr: Rien à réviser pour l’instant. Tu es à jour.
hi: अभी पढ़ने के लिए कुछ नहीं है। आप पूरी तरह तैयार हैं।
ja: 今は勉強することはありません。すべて順調です。
ko: 지금은 공부할 항목이 없어요. 모두 따라잡았어요.
pt_br: Nada para estudar agora. Você está em dia.
zh_hans: 现在没有需要学习的内容，你已经跟上进度了。
